/**********************************************************************
[[スライドGIMMICKヘッダー(Gimmick/Slide.h)]]
	作者：奥田　真規

	Gimmick/Slide.cppに関するヘッダー
***********************************************************************/
#pragma once


//---------------------------------------------------------------------
//	構造体、列挙体、共用体宣言 (他cppでも使用する)
//---------------------------------------------------------------------


//---------------------------------------------------------------------
//	プロトタイプ宣言 (他cppでも使用する)
//---------------------------------------------------------------------

/*=====================================================================
スライド初期化関数
=====================================================================*/
GIMMICK_HEADER *GetSlideMemory(FIELD_CHIP* pChip, Vec3* pos);

// 基本関数群
void InitFieldGimmickSlide();
void UninitFieldGimmickSlide();
void ResetFieldGimmickSlide();
void AllEndFieldGimmickSlide();