/**********************************************************************
[[壁GIMMICKヘッダー(Gimmick/Wall.h)]]
	作者：奥田　真規

	Gimmick/Wall.cppに関するヘッダー
***********************************************************************/
#pragma once
#include "Gimmick.h"

//---------------------------------------------------------------------
//	構造体、列挙体、共用体宣言 (他cppでも使用する)
//---------------------------------------------------------------------

// 壁GIMMICKのQTEボタン列挙
enum GIMICKWALL_QTE {
	GQTE_X = 0,
	GQTE_Y = 1,
	//GQTE_A = 2,
	//GQTE_B = 3,
	MAX_GIMICKWALLQTE		/*要素数取得*/
};
//---------------------------------------------------------------------
//	プロトタイプ宣言 (他cppでも使用する)
//---------------------------------------------------------------------

/*=====================================================================
壁初期化関数
=====================================================================*/
GIMMICK_HEADER *GetWallMemory(FIELD_CHIP* pChip, Vec3* pos, GIMICKWALL_QTE Type);


/*=====================================================================
壁テクスチャ変更関数
=====================================================================*/
void SetWallTextureForGamePad(bool isShowPad);

// 基本関数群
void InitFieldGimmickWall();
void UninitFieldGimmickWall();
void ResetFieldGimmickWall();
void AllEndFieldGimmickWall();