/**********************************************************************
[[フェーズ:GameTackle3プログラム(Phase_GameTackle3.cpp)]]
	作者：奥田　真規

	フェーズ：GameTackle3に関するプログラム
***********************************************************************/
#include"../Core/main.h"	
#include "../Core/fade.h"
#include "../Core/input.h"
#include "../Core/sound.h"
#include "../Core/camera.h"
#include "../Core/debugproc.h"

#include "Phase_GameTackle3.h"	
#include "Phase_GameKick.h"
//---------------------------------------------------------------------
//	マクロ定義(同cpp内限定)
//---------------------------------------------------------------------

//---------------------------------------------------------------------
//	構造体、列挙体、共用体宣言(同cpp内限定)
//---------------------------------------------------------------------

//---------------------------------------------------------------------
//	プロトタイプ宣言(同cpp内限定)
//---------------------------------------------------------------------

//---------------------------------------------------------------------
//	グローバル変数
//---------------------------------------------------------------------

// 画面遷移基本関数群をまとめておく
static PHASE_FUNC g_PhaseFunc = { InitGameTackle3,UninitGameTackle3,UpdateGameTackle3,DrawGameTackle3 };

/*=====================================================================
GameTackle3更新関数
=====================================================================*/
void UpdateGameTackle3()
{
	PrintDebugProc("タックル3フェーズ");

	// 次のフェーズに行く
	if (GetKeyboardTrigger(DIK_RETURN) || IsButtonTriggered(0, BUTTON_C))
	{	// キック
		GoNextPhase(GetPhaseGameKickFunc());
	}

}

/*=====================================================================
GameTackle3描画関数
=====================================================================*/
void DrawGameTackle3()
{

}

/*=====================================================================
GameTackle3初期化関数
	戻り値 : void
	引数 :
	bool isFirst		true:リソース読み込み系を含めた初期化処理を行う
							　※ この処理がある場合はmain.cpp内の		  ※
							  ※ InitGameResource関数に引数trueで書くこと ※

						false;リソース開放系以外の初期化処理を行う
=====================================================================*/
void InitGameTackle3(bool isFirst)
{
	if (isFirst == true)
	{
		//---------------------------------------------------------------------
		//	リソース読み込み処理(Create???,Load???,シリーズ)
		//---------------------------------------------------------------------

		return;
	}

	//---------------------------------------------------------------------
	//	グローバル変数等のステータス書き換え処理
	//---------------------------------------------------------------------


}

/*=====================================================================
GameTackle3終了化関数
	戻り値 : void
	引数 :
	bool isEnd			true:リソース開放系を含めた終了化処理を行う
							　※ この処理がある場合はmain.cpp内の		    ※
							  ※ UninitGameResource関数に引数trueで書くこと ※

						false;リソース開放系以外の終了化処理を行う	
=====================================================================*/
void UninitGameTackle3(bool isEnd)
{
	//---------------------------------------------------------------------
	//	その他の終了処理
	//---------------------------------------------------------------------




	if (isEnd == false)
	{
		return;
	}
	//---------------------------------------------------------------------
	//	リソース開放処理
	//---------------------------------------------------------------------

	

}

/*=====================================================================
GameTackle3基本関数群取得関数
=====================================================================*/
PHASE_FUNC* GetPhaseGameTackle3Func()
{
	return &g_PhaseFunc;
}