/**********************************************************************
[[フェーズ:GameKickプログラム(Phase_GameKick.cpp)]]
	作者：奥田　真規

	フェーズ：GameKickに関するプログラム
***********************************************************************/
#include"../Core/main.h"	
#include "../Core/fade.h"
#include "../Core/input.h"
#include "../Core/sound.h"
#include "../Core/camera.h"
#include "../Core/debugproc.h"

#include "Phase_GameKick.h"	
#include "Phase_Result.h"

#include "../GameKick/OrderLogo.h"

//---------------------------------------------------------------------
//	マクロ定義(同cpp内限定)
//---------------------------------------------------------------------

//---------------------------------------------------------------------
//	構造体、列挙体、共用体宣言(同cpp内限定)
//---------------------------------------------------------------------

//---------------------------------------------------------------------
//	プロトタイプ宣言(同cpp内限定)
//---------------------------------------------------------------------

//---------------------------------------------------------------------
//	グローバル変数
//---------------------------------------------------------------------

// 画面遷移基本関数群をまとめておく
static PHASE_FUNC g_PhaseFunc = { InitGameKick,UninitGameKick,UpdateGameKick,DrawGameKick };

/*=====================================================================
GameKick更新関数
=====================================================================*/
void UpdateGameKick()
{
	PrintDebugProc("最後のキックフェーズ");

	// 次のフェーズに行く
	if (GetKeyboardTrigger(DIK_RETURN) || IsButtonTriggered(0, BUTTON_C))
	{	// リザルト
		GoNextPhase(GetPhaseResultFunc());
	}


	GetOrderLogoFunc()->Update();
}

/*=====================================================================
GameKick描画関数
=====================================================================*/
void DrawGameKick()
{
	GetOrderLogoFunc()->Draw();

}

/*=====================================================================
GameKick初期化関数
	戻り値 : void
	引数 :
	bool isFirst		true:リソース読み込み系を含めた初期化処理を行う
							　※ この処理がある場合はmain.cpp内の		  ※
							  ※ InitGameResource関数に引数trueで書くこと ※

						false;リソース開放系以外の初期化処理を行う
=====================================================================*/
void InitGameKick(bool isFirst)
{
	if (isFirst == true)
	{
		//---------------------------------------------------------------------
		//	リソース読み込み処理(Create???,Load???,シリーズ)
		//---------------------------------------------------------------------

		GetOrderLogoFunc()->Init(true);

		return;
	}

	//---------------------------------------------------------------------
	//	グローバル変数等のステータス書き換え処理
	//---------------------------------------------------------------------

	GetOrderLogoFunc()->Init(false);

}

/*=====================================================================
GameKick終了化関数
	戻り値 : void
	引数 :
	bool isEnd			true:リソース開放系を含めた終了化処理を行う
							　※ この処理がある場合はmain.cpp内の		    ※
							  ※ UninitGameResource関数に引数trueで書くこと ※

						false;リソース開放系以外の終了化処理を行う	
=====================================================================*/
void UninitGameKick(bool isEnd)
{
	//---------------------------------------------------------------------
	//	その他の終了処理
	//---------------------------------------------------------------------

	GetOrderLogoFunc()->Uninit(false);



	if (isEnd == false)
	{
		return;
	}
	//---------------------------------------------------------------------
	//	リソース開放処理
	//---------------------------------------------------------------------

	GetOrderLogoFunc()->Uninit(true);


}

/*=====================================================================
GameKick基本関数群取得関数
=====================================================================*/
PHASE_FUNC* GetPhaseGameKickFunc()
{
	return &g_PhaseFunc;
}