/**********************************************************************
[[Phase_GameTackle3ヘッダー(Phase_GameTackle3.h)]]
	作者：GameTackle3GameTackle3？？

	Phase_GameTackle3.cppに関するヘッダー
***********************************************************************/
#pragma once


//---------------------------------------------------------------------
//	構造体、列挙体、共用体宣言 (他cppでも使用する)
//---------------------------------------------------------------------

//---------------------------------------------------------------------
//	プロトタイプ宣言 (他cppでも使用する)
//---------------------------------------------------------------------

/*=====================================================================
GameTackle3基本関数群取得関数
=====================================================================*/
PHASE_FUNC* GetPhaseGameTackle3Func();

// 基本関数群
void InitGameTackle3(bool isFirst);
void UninitGameTackle3(bool isEnd);
void UpdateGameTackle3();
void DrawGameTackle3();