/**********************************************************************
[[Phase_GameTackle2ヘッダー(Phase_GameTackle2.h)]]
	作者：GameTackle2GameTackle2？？

	Phase_GameTackle2.cppに関するヘッダー
***********************************************************************/
#pragma once


//---------------------------------------------------------------------
//	構造体、列挙体、共用体宣言 (他cppでも使用する)
//---------------------------------------------------------------------

//---------------------------------------------------------------------
//	プロトタイプ宣言 (他cppでも使用する)
//---------------------------------------------------------------------

/*=====================================================================
GameTackle2基本関数群取得関数
=====================================================================*/
PHASE_FUNC* GetPhaseGameTackle2Func();

// 基本関数群
void InitGameTackle2(bool isFirst);
void UninitGameTackle2(bool isEnd);
void UpdateGameTackle2();
void DrawGameTackle2();