/**********************************************************************
[[ボーナススコアヘッダー(bonusscore.h)]]
	作者：奥田　真規

	bonusscore.cppに関するヘッダー
***********************************************************************/
#pragma once

#define START_COMMONBONUS		(BST_COINEX)	// Commonボーナスかの判別用
//---------------------------------------------------------------------
//	構造体、列挙体、共用体宣言 (他cppでも使用する)
//---------------------------------------------------------------------

// ボーナススコアの種類
enum BONUSSCORE_TYPE {
	/* 以下は1回取得系 */
	// コイン収集系アチーブメント
	BST_COIN1,
	BST_COIN2,
	BST_COIN3,
	BST_COIN4,

	// 総距離系アチーブメント
	BST_RUN1,
	BST_RUN2,
	BST_RUN3,
	BST_RUN4,
	BST_RUN5,
	BST_RUN6,

	// 上記２つの複合アチーブメント
	BST_COIN3RUN4,
	BST_COIN4RUN5,

	// ギミック処理回数系アチーブメント
	BST_GIMMICK1,
	BST_GIMMICK2,
	BST_GIMMICK3,

	// 生存時間アチーブメント
	BST_LIVETIME1,

	/* 以下は複数取得系 */

	BST_COINEX,
	BST_RUNEX,
	BST_GIMMICKEX,
	BST_RAREVOICE,
	BST_GIMMICKWALL,
	BST_SNEAK,
	BST_COINPERRUN,
	BST_JUSTINTARACT,

	MAX_BONUSSCORETYPE
};

//---------------------------------------------------------------------
//	プロトタイプ宣言 (他cppでも使用する)
//---------------------------------------------------------------------

/*=====================================================================
ボーナススコア設定関数
=====================================================================*/
void AddBonusScore(BONUSSCORE_TYPE bst);

/*=====================================================================
ボーナススコア取得関数
=====================================================================*/
DWORD GetBonusScore();

/*=====================================================================
ボーナスフラグ取得関数
=====================================================================*/
bool IsSetRareBonus(BONUSSCORE_TYPE rareBonus);

// 基本関数群
void InitBonusScore(int type);
void UninitBonusScore();
void DrawBonusScore();
void UpdateBonusScore();
