/**********************************************************************
[[タイトルエフェクトヘッダー(Title_effect.h)]]
	作者：奥田　真規

	Title_effect.cppに関するヘッダー
***********************************************************************/
#pragma once
#include "Core/main.h"



//---------------------------------------------------------------------
//	構造体、列挙体、共用体宣言 (他cppでも使用する)
//---------------------------------------------------------------------

//---------------------------------------------------------------------
//	プロトタイプ宣言 (他cppでも使用する)
//---------------------------------------------------------------------

/*=====================================================================
3Dエフェクト設置関数(簡易版）
　拡張版関数の引数にある程度調整した乱数を指定して設置します。
戻り値：void
=====================================================================*/
void SetTitle3DEffect();

/*=====================================================================
3Dエフェクト設置関数(拡張版）
戻り値：void
引数：
float	len,		中心軸からの距離
float	agl,		中心軸の回転角度
float	spd,		カメラに向かってくる速度
Color*	col,		エフェクトの色
Vec3*	paddrot		毎フレーム毎にエフェクト自体を回転させる量
=====================================================================*/
void SetTitle3DEffectEx(float len, float agl, float spd, Color *col, Vec3* paddrot);


// タイトルエフェクト基本関数群(PHASE_TITLE専用)
void UpdateTitleEffect();
void DrawTitleEffect();
void InitTitleEffect(bool isFirstInit);
void UninitTitleEffect(bool isLastUninit);
