/**********************************************************************
[[ボールヘッダー(Ball.h)]]
	作者：奥田　真規

	Ball.cppに関するヘッダー
***********************************************************************/
#pragma once

#define MAX_BALL	(100)

#define MAX_EFFECT_BALL	(10)
//---------------------------------------------------------------------
//	構造体、列挙体、共用体宣言 (他cppでも使用する)
//---------------------------------------------------------------------

//---------------------------------------------------------------------
//	プロトタイプ宣言 (他cppでも使用する)
//---------------------------------------------------------------------
HRESULT InitBall(void);
int CreateBall(D3DXVECTOR3 pos, D3DXVECTOR3 rot = D3DXVECTOR3(0.0f, 0.0f, 0.0f)
	, D3DXVECTOR3 eng = D3DXVECTOR3(0.0f, 0.0f, 0.0f),
	D3DXVECTOR3 scl = D3DXVECTOR3(1.0f, 1.0f, 1.0f)
	);

void DeleteBall(int Ball_ID);
void UpdateBall(void);
void DrawBall(void);
void UninitBall(void);