//=============================================================================
//
// カメラ処理 [camera.h]
// Author : 
//
//=============================================================================
#ifndef _CAMERA_H_
#define _CAMERA_H_

#include "main.h"

// カメラ構造体
typedef struct {
	Vec3 pos;		// 視点
	Vec3 at;		// 注視点
	Vec3 up;		// 上方向ベクトル(正規化ひっす)

	float angle;	// 視野角
	float aspect;	// アスペクト比	(横/縦)
	float nearZ;	// ビュー平面のNearZ値
	float farZ;		// ビュー平面のFarZ値
}CAMERA;

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************


//=============================================================================
// ビューマトリックスの取得(Draw関数内でのみ有効、Update内だと1フレーム前の行列になる)
//=============================================================================
D3DXMATRIX *GetMtxView(void);

//=============================================================================
// カメラ情報の取得(位置変更などもこの関数から行う)
//=============================================================================
CAMERA *GetCamera();


// カメラ基本関数群(main.cpp専用)
HRESULT InitCamera(void);
void UninitCamera(void);
//void UpdateCamera(void);
void SetCamera(void);		
#endif
